package com.example.TgBimBot.finalVariables.messageTexts;

public class AlfaBankMessageTexts {

    public static final String ALFA_BANK_MESSAGE =
            "<b>Альфа-Банк. Выбери продукт:</b>\n\n" +
            "Ниже представленны все продукты, за которые можно получить " +
            "денежное вознаграждение.\nЗа некоторые из них деньги получаю только я " +
            "или моё вознаграждение больше вашего, " +
            "но в любом случае мы всё делим 50/50.\n\n" +
            "<i>За любые другие продукты денежное вознаграждение <b>не предусмотренно</b></i>!";
    public static final String ALFA_BANK_CARDS_MESSAGE =
            "<b>Альфа-Банк, Карты. Выбери карту:</b>";

    public static final String ALFA_BANK_BUSINESS_MESSAGE =
            "<b>Альфа-Банк, Бизнес. Выбери продукт или услугу:</b>";
    public static final String ALFA_BANK_DEBIT_MESSAGE =
            "<b>Альфа-Банк, Дебетовая карта. Оформи по ссылке:</b>\n\n" +
            "<b>Условия получения бонуса:</b>\n" +
            "<i>• Вы делаете покупку на любую сумму.</i>\n\n" +
            "<b>Размер выплаты:</b>\n" +
            "<i>• Выплата мне - 300р;\n" +
            "• Выплата вам - 300р.</i>\n\n" +
            "Остались вопросы - /support";
    public static final String ALFA_BANK_CREDIT_MESSAGE =
            "<b>Альфа-Банк, Кредитная карта. Оформи по ссылке:</b>\n\n" +
            "<b>Размер выплаты по умолчанию:</b>\n" +
            "<i>• Выплата мне - 2500р;\n" +
            "• Выплата вам - 500р.</i>\n\n" +
            "<b>Итоговое распределение выплаты:</b>\n" +
            "<i>• Я перевожу вам 1000р;\n" +
            "• Каждый оказывается в плюсе на 1500р.</i>\n\n" +
            "Остались вопросы - /support";
    public static final String ALFA_BANK_BUSINESS_ACCOUNT_MESSAGE =
            "<b>Альфа-Банк, Счёт для бизнеса. Оформи по ссылке:</b>\n\n" +
            "<b>Размер выплаты по умолчанию:</b>\n" +
            "<i>• Выплата мне - 4000р;\n" +
            "• Выплата вам - 2000 <u>баллов</u>.</i>\n\n" +
            "<b>Итоговое распределение выплаты:</b>\n" +
            "<i>• Я перевожу вам 2000р;\n" +
            "• Каждый оказывается в плюсе на 2000р.</i>\n\n" +
            "Остались вопросы - /support";
    public static final String ALFA_BANK_BUSINESS_REGISTRATION_MESSAGE =
            "<b>Альфа-Банк, Регистрация бизнеса. Оформи по ссылке:</b>\n\n" +
            "<b>Размер выплаты по умолчанию:</b>\n" +
            "<i>• Выплата мне - 4000р;\n" +
            "• Выплата вам - 2000 <u>баллов</u>.</i>\n\n" +
            "<b>Итоговое распределение выплаты:</b>\n" +
            "<i>• Я перевожу вам 2000р;\n" +
            "• Каждый оказывается в плюсе на 2000р.</i>\n\n" +
            "Остались вопросы - /support";
    public static final String ALFA_BANK_ONLY_MESSAGE =
            "<b>Альфа-Банк, Alfa Only. Оформи по ссылке:</b>\n\n" +
            "<b>Размер выплаты по умолчанию:</b>\n" +
            "<i>• Выплата мне - 7000р;\n" +
            "• Выплата вам - 3000р.</i>\n\n" +
            "<b>Итоговое распределение выплаты:</b>\n" +
            "<i>• Я перевожу вам 2000р;\n" +
            "• Каждый оказывается в плюсе на 5000р.</i>\n\n" +
            "Остались вопросы - /support";
    public static final String ALFA_BANK_TRAVEL_MESSAGE =
            "<b>Альфа-Банк, Alfa Travel. Оформи по ссылке:</b>\n\n" +
            "<b>Размер выплаты:</b>\n" +
            "<i>• Выплата мне - 300р;\n" +
            "• Выплата вам - 300р.</i>\n\n" +
            "Остались вопросы - /support";
    public static final String ALFA_BANK_OTHER_MESSAGE =
            "<b>Альфа-Банк, Другое. Выбери продукт:</b>";
    public static final String ALFA_BANK_STICKER_MESSAGE =
            "<b>Альфа-Банк, Альфа-Стикер. Оформи по ссылке:</b>\n\n" +
            "<b>Размер выплаты:</b>\n" +
            "<i>• Выплата мне - 300р;\n" +
            "• Выплата вам - 300р.</i>\n\n" +
            "Остались вопросы - /support";
}
