package com.example.TgBimBot.finalVariables.messageTexts;

public class TBankMessageTexts {

    public static final String T_BANK_MESSAGE =
            "<b>Т-Банк. Выбери продукт:</b>\n\n" +
                    "Ниже представленны все продукты, за которые можно получить " +
                    "денежное вознаграждение.\nЗа некоторые из них деньги получаю только я " +
                    "или моё вознаграждение больше вашего, " +
                    "но в любом случае мы всё делим 50/50.\n\n" +
                    "<i>За любые другие продукты денежное вознаграждение <b>не предусмотренно</b></i>!";
    public static final String T_BANK_CARDS_MESSAGE =
            "<b>Т-Банк, Карты. Выбери карту:</b>";
    public static final String T_BANK_BUSINESS_MESSAGE =
            "<b>Т-Банк, Бизнес. Выбери продукт или услугу:</b>";
    public static final String T_BANK_INSURANCE_MESSAGE =
            "<b>Т-Банк, Страхование. Выбери страхование:</b>";
    public static final String T_BANK_CREDITS_MESSAGE =
            "<b>Т-Банк, Кредиты. Выбери кредит:</b>";
    public static final String T_BANK_OTHER_MESSAGE =
            "<b>Т-Банк, Другое. Выбери продукт или услугу:</b>";
    public static final String T_BANK_BLACK_MESSAGE =
            "<b>Т-Банк, Black. Оформи по ссылке:</b>\n\n" +
                    "<b>Условия получения бонуса:</b>\n" +
                    "<i>• Вы делаете покупку от 300 рублей одной операцией в течение 90 дней;\n" +
                    "• В течение 7 дней после обработки операции мне и вам придёт бонус.</i>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 1000р;\n" +
                    "• Выплата вам - 500р.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 250р;\n" +
                    "• Каждый оказывается в плюсе на 750р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_PLATINUM_MESSAGE =
            "<b>Т-Банк, Платинум. Оформи по ссылке:</b>\n\n" +
                    "<b>Условия получения бонуса:</b>\n" +
                    "<i>• Вы делаете покупку от 1000 рублей одной операцией в течение 90 дней;\n" +
                    "• В течение 7 дней после обработки операции мне и вам придёт бонус.</i>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 1500р;\n" +
                    "• Выплата вам - бесплатное обслуживание навсегда.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 750р;\n" +
                    "• Каждый оказывается в плюсе на 750р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_MOBILE_MESSAGE =
            "<b>Т-Банк, Мобайл. Оформи по ссылке:</b>\n\n" +
                    "<b>Условия получения бонуса:</b>\n" +
                    "<i>• Вы пополняете баланс сим-карты на 200р.</i>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 500р;\n" +
                    "• Выплата вам - 500 бонусов и сервисы бесплатно навсегда.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 250р;\n" +
                    "• Каждый оказывается в плюсе на 250р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_INVESTMENT_MESSAGE =
            "<b>Т-Банк, Инвестиции. Оформи по ссылке:</b>\n\n" +
                    "<b>Условия получения бонуса:</b>\n" +
                    "<i>• Вам нужно купить ценные бумаги на сумму от 10 000р, " +
                    "для несовершеннолетних — от 5 000р;\n" +
                    "•  Стоимость портфеля нужно продерживать выше этой суммы " +
                    "до конца следующего торгового дня, не продавая бумаг;\n" +
                    "• Все условия нужно выполнить за 30 дней с момента открытия счета;\n" +
                    "• Подарочные акции будут начислены в течение 10 календарных дней.</i>\n\n" +
                    "<b>Размер выплаты:</b>\n" +
                    "<i>• Выплата мне - акция до 500р;\n" +
                    "• Выплата вам - акция до 500р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_BUSINESS_ACCOUNT_MESSAGE =
            "<b>Т-Банк, Счёт для бизнеса. Оформи по ссылке:</b>\n\n" +
                    "<b>Условия получения бонуса:</b>\n" +
                    "<i>• Вы начинаете пользоваться счётом.</i>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 1000р;\n" +
                    "• Выплата вам - 3 месяца обслуживания бесплатно.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 500р;\n" +
                    "• Каждый оказывается в плюсе на 500р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_BUSINESS_REGISTRATION_MESSAGE =
            "<b>Т-Банк, Регистрация бизнеса. Оформи по ссылке:</b>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 1000р;\n" +
                    "• Выплата вам - 3 месяца обслуживания бесплатно.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 500р;\n" +
                    "• Каждый оказывается в плюсе на 500р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_AIR_MESSAGE =
            "<b>Т-Банк, Авиабилеты. Оформи по ссылке:</b>\n\n" +
                    "<b>Условия получения бонуса:</b>\n" +
                    "<i>• Вы переходите по моей ссылке, выбираете билет " +
                    "и оплачиваете его картой Т-Банка.</i>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 1000р;\n" +
                    "• Выплата вам - кэшбэк до 7% от стоимости билета.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 500р;\n" +
                    "• Каждый оказывается в плюсе на 500р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_CASCO_MESSAGE =
            "<b>Т-Банк, КАСКО. Оформи по ссылке:</b>\n\n" +
                    "<b>Условия получения бонуса:</b>\n" +
                    "<i>• Вы оформляете полис КАСКО сроком действия 1 год " +
                    "и не прекращаете договор в течение 15 дней.</i>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 5000р;\n" +
                    "• Выплата вам - скидка 10%.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 2500р;\n" +
                    "• Каждый оказывается в плюсе на 2500р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_OSAGO_MESSAGE =
            "<b>Т-Банк, ОСАГО. Оформи по ссылке:</b>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 500р;\n" +
                    "• Выплата вам - 500р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_MORTGAGE_INSURANCE_MESSAGE =
            "<b>Т-Банк, Страхование ипотеки. Оформи по ссылке:</b>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 1500р;\n" +
                    "• Выплата вам - кэшбэк 5% от стоимости полиса.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 750р;\n" +
                    "• Каждый оказывается в плюсе на 750р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_CREDIT_MESSAGE =
            "<b>Т-Банк, Кредиты. Выбери кредит:</b>\n";
    public static final String T_BANK_CREDIT_CASH_MESSAGE =
            "<b>Т-Банк, Кредит наличными. Оформи по ссылке:</b>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 1000р;\n" +
                    "• Выплата вам - повышенный кредитный лимит.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 500р;\n" +
                    "• Каждый оказывается в плюсе на 500р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_CREDIT_AUTO_MESSAGE =
            "<b>Т-Банк, Автокредит. Оформи по ссылке:</b>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 5000р;\n" +
                    "• Выплата вам - повышенный кредитный лимит.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 2500р;\n" +
                    "• Каждый оказывается в плюсе на 2500р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_CREDIT_BY_ESTATE_MESSAGE =
            "<b>Т-Банк, Кредит под залог недвижимости. Оформи по ссылке:</b>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 3000р;\n" +
                    "• Выплата вам - повышенный кредитный лимит.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 1500р;\n" +
                    "• Каждый оказывается в плюсе на 1500р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_CREDIT_BY_AUTO_MESSAGE =
            "<b>Т-Банк, Кредит под залог авто. Оформи по ссылке:</b>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 3000р;\n" +
                    "• Выплата вам - повышенный кредитный лимит.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 1500р;\n" +
                    "• Каждый оказывается в плюсе на 1500р.</i>\n\n" +
                    "Остались вопросы - /support";
    public static final String T_BANK_CREDIT_REFINANCING_MESSAGE =
            "<b>Т-Банк, Рефинансирование кредитов. Оформи по ссылке:</b>\n\n" +
                    "<b>Размер выплаты по умолчанию:</b>\n" +
                    "<i>• Выплата мне - 1000р;\n" +
                    "• Выплата вам - выгодные условия рефинансирования.</i>\n\n" +
                    "<b>Итоговое распределение выплаты:</b>\n" +
                    "<i>• Я перевожу вам 500р;\n" +
                    "• Каждый оказывается в плюсе на 500р.</i>\n\n" +
                    "Остались вопросы - /support";
}
